IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28002x_periph_ac_regs.xml
<module id="PERIPH_AC_REGS" HW_revision="" description="PERIPH AC Registers">
	<register id="ADCA_AC" width="32" page="1" offset="0x0" internal="0" description="ADCA Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="ADCC_AC" width="32" page="1" offset="0x4" internal="0" description="ADCC Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="CMPSS1_AC" width="32" page="1" offset="0x10" internal="0" description="CMPSS1 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="CMPSS2_AC" width="32" page="1" offset="0x12" internal="0" description="CMPSS2 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="CMPSS3_AC" width="32" page="1" offset="0x14" internal="0" description="CMPSS3 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="CMPSS4_AC" width="32" page="1" offset="0x16" internal="0" description="CMPSS4 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWM1_AC" width="32" page="1" offset="0x48" internal="0" description="EPWM1 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWM2_AC" width="32" page="1" offset="0x4a" internal="0" description="EPWM2 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWM3_AC" width="32" page="1" offset="0x4c" internal="0" description="EPWM3 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWM4_AC" width="32" page="1" offset="0x4e" internal="0" description="EPWM4 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWM5_AC" width="32" page="1" offset="0x50" internal="0" description="EPWM5 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWM6_AC" width="32" page="1" offset="0x52" internal="0" description="EPWM6 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="EPWM7_AC" width="32" page="1" offset="0x54" internal="0" description="EPWM7 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="EQEP1_AC" width="32" page="1" offset="0x70" internal="0" description="EQEP1 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="EQEP2_AC" width="32" page="1" offset="0x72" internal="0" description="EQEP2 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="ECAP1_AC" width="32" page="1" offset="0x80" internal="0" description="ECAP1 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="ECAP2_AC" width="32" page="1" offset="0x82" internal="0" description="ECAP2 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="ECAP3_AC" width="32" page="1" offset="0x84" internal="0" description="ECAP3 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="CLB1_AC" width="32" page="1" offset="0xb0" internal="0" description="CLB1 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="CLB2_AC" width="32" page="1" offset="0xb2" internal="0" description="CLB2 Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="SCIA_AC" width="32" page="1" offset="0x100" internal="0" description="SCIA Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="SPIA_AC" width="32" page="1" offset="0x110" internal="0" description="SPIA Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="SPIB_AC" width="32" page="1" offset="0x112" internal="0" description="SPIB Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="I2CA_AC" width="32" page="1" offset="0x120" internal="0" description="I2CA Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="I2CB_AC" width="32" page="1" offset="0x122" internal="0" description="I2CB Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="PMBUS_A_AC" width="32" page="1" offset="0x130" internal="0" description="PMBUSA Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="LIN_A_AC" width="32" page="1" offset="0x138" internal="0" description="LINA Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="LIN_B_AC" width="32" page="1" offset="0x13a" internal="0" description="LINB Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="DCANA_AC" width="32" page="1" offset="0x140" internal="0" description="DCANA Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="FSIATX_AC" width="32" page="1" offset="0x158" internal="0" description="FSIA Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="FSIARX_AC" width="32" page="1" offset="0x15a" internal="0" description="FSIB Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="HRPWM_A_AC" width="32" page="1" offset="0x1aa" internal="0" description="HRPWM Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="HICA_ACC" description="HICA Access Contions to Peripheral" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="HIC_A_AC" width="32" page="1" offset="0x1ac" internal="0" description="HIC Master Access Control Register">
		<bitfield id="CPU1_ACC" description="CPU1 Access conditions to peripheral" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="DMA1_ACC" description="DMA1 Access Conditions to Peripheral" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="PERIPH_AC_LOCK" width="32" page="1" offset="0x1fe" internal="0" description="Lock Register to stop Write access to peripheral Access register. ">
		<bitfield id="LOCK_AC_WR" description=" Lock control for Access control registers write." begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
</module>
